{
    "Randomization": {
        "rating": "",
        "description": " Randomization is a unclassified \"difficulty\" if you want a challenge. Although it is a difficulty, It can also be considered a mode, And a challange due to it being entirely randomized. So, Good luck trying to beat this, And have fun."
    },
    "Blank": {
        "rating": "",
        "description": null
    },
    "Construct": {
        "rating": "",
        "description": "Construct is an Unclassified difficulty that has a special quirk that allows you to place parts in a tower. This can be done with the Blueprint. You can also delete parts with the Hammer. Although, if the difficulty was high enough, the Hammer could be removed. There are also special areas called Barriers. These are parts of the tower where you cannot place any parts. A Deadly Barrier is more dangerous, though, as if you go inside it, you have to restart your whole run, much like GBJs."
    },
    "Walking": {
        "rating": "",
        "description": null
    },
    "Reflective": {
        "rating": "",
        "description": " Reflective is an Unclassified difficulty. This difficulty ranges from Class Negative to Class 12, the obstacle depends how much amount of reflectance the floor has. Take a example of a floor that is 9.22Qn reflectance, the floor will be in Class 8. \nReflective was originally a sub-difficulty located in Class 0, the first version was a sub-difficulty of Failable (deleted) (14 January 2021 to 30 January 2021‎). Later it was moved to a different difficulty, which was Brilliant (deleted) (31 January 2021 to 11 July 2021‎). Even later it was moved again to Lovely (12 July 2021 to 2 February 2022). At February 2022 the page creator (Astrominal) requested YourNuglyguy to move this difficulty to Unclassified, and it was accepted. "
    },
    "Sketchy": {
        "rating": "",
        "description": "Sketchy is an unclassified unofficial difficulty with no determinable posterior or anterior difficulties, due to its unclassified nature. The difficulty of this ranges from about The First Difficulty to Babass dficuklty, meaning it is the unclassified difficulty with the greatest range, due to the other unclassifieds going from The First Difficulty to The Final Difficulty at maximum."
    },
    "Puzzling": {
        "rating": "",
        "description": null
    },
    "15]] (EVEN": {
        "rating": "",
        "description": null
    },
    "Zemblanity": {
        "rating": "",
        "description": null
    },
    "Spectrumplex": {
        "rating": "-",
        "description": null
    },
    "Gingerbread": {
        "rating": "",
        "description": null
    },
    "Epic": {
        "rating": "",
        "description": " Epic is an Easy sub-difficulty made by Alphajake2009. Don't be confused, this is not the JToH April Fools 2020 difficulty. This is based on slow spinners, buttons, morphers and more epic stuff! There are also some jumps to 1.5 stud platforms. Little knowledge is need to beat this difficulty! "
    },
    "korn": {
        "rating": "",
        "description": null
    },
    "OooOOOoOOOOooo above catastrophic difficulty OoOOooOOoo": {
        "rating": "",
        "description": null
    },
    "Sisyphus": {
        "rating": "",
        "description": null
    },
    "Epinephrine": {
        "rating": "",
        "description": null
    },
    "OVERKILL": {
        "rating": "",
        "description": null
    },
    "MSD Speedy": {
        "rating": "",
        "description": null
    },
    "Gui remorseless": {
        "rating": "",
        "description": null
    },
    "Divine": {
        "rating": "",
        "description": null
    },
    "Gui nil": {
        "rating": "",
        "description": null
    },
    "Anti Boby": {
        "rating": "}",
        "description": null
    },
    "The First Difficulty": {
        "rating": "-∞",
        "description": "The First Difficulty is the absolute beginning of your journey and the easiest of all difficulties. This difficulty is even below bottom The Lower Gap and anything in between. \nThis difficulty is the exact opposite of The Final Difficulty (TFD). Instead of being infinitely unbeatable, it is infinitely unlosable, no matter what kind of logic is applied. \nUnlike Negativity (where you need a negative existence rank to lose), there is no exception to winning. Even if you don't exist, you are less than any form of existence, you are beyond any form of existence, you have control over your existence on any sort of space/time plane imaginable, you have infinite power, or even you have a;; these things and more at the same time, you will still always unwillingly win this difficulty. \nThis difficulty is impossible to build, even with unlimited scripting capabilities beyond that of existence. Even if you had the powers of a god and spent all of your immortality into losing this difficulty, you would still win."
    },
    "The Lower Gap": {
        "rating": "-∞ to 115",
        "description": "The Lower Gap is a Class Negative difficulty that represents the gap between The First Difficulty and The Middleline. Despite being Class Negative, The Lower Gap can reach all the way up to Peak Class 10. This is since the difficulties inside of the Gaps are when ranking Gaps. Since Negativity to Viratical are all part of The Lower Gap and anything harder isn't, every sub-difficulty of this, baseline to peak, represents 1 class. However Difficulty Chart Towers assume The Lower Gap to be the gap between TFirD and Negativity.\nBasically, TLG is everything from TFirD to TM. TooHard begins at Nil, and never ends, imagine TLG with the same concept as TooHard, but beginning at TFirD and instead of never ending, it ends at Viratical."
    },
    "Negativity": {
        "rating": "-(FOOT<sup>10</sup>(10<sup>100</sup>))",
        "description": null
    },
    "Unimpossible": {
        "rating": "-Rayo(10<sup>100</sup>)",
        "description": " Unimpossible is the fourth difficulty of the entire Difficulty Chart, and is therefore a Class Negative difficulty. As its name suggests, this the complete opposite of impossibility, and is transmaximally easy. You are always completing this difficulty, as with every beyond existence difficulty.\nIt is the complete antipode of Effortful, and is beyond Negativity, yet before Friendliness. It also have 2 subs, being Almost Unimpossible, and Ununpossible, even though they are now CDC exclusive. "
    },
    "Friendliness": {
        "rating": "-TREE(3)",
        "description": null
    },
    "True Ease": {
        "rating": "-G<sub>64</sub>",
        "description": "True Ease is a Class Negative difficulty. This is one of the easiest difficulties ever if anything exists in any universe, omniverse, and, every possible dimension, even if it's an atom in a single universe, everything wins, including everything in every different dimension. If nothing exists, everything wins, even things in every dimension. \nEven if you find a way to be in a separate state of living apart from existing and not, everything still wins, and even if there’s a tower of this difficulty in a different dimension that nothing can escape from, somehow it will find its way into every dimension, even dimensions that are not accessible and don’t exist yet, you will always win..."
    },
    "Felix the ДА": {
        "rating": "-10<sup>1Qd</sup>",
        "description": "Felix the ДА is a difficulty, somehow laying in between A and Exist. You don't even have to exist to complete this! I mean, all of the difficulties before this one said that too, so whatever. \nFelix is a simplistic difficulty no one can ever lose. It is truly impossible to lose something this pathetic. (True, that was said in the above paragraph but I’m out of ideas) It is the opposite of Felix the нет. Да in Russian means Yes, by the way. "
    },
    "Exist": {
        "rating": "-10<sup>100</sup>",
        "description": null
    },
    "Reversed Peripherality": {
        "rating": "-10<sup>10</sup>",
        "description": null
    },
    "Relax": {
        "rating": "-1,000,000",
        "description": null
    },
    "Restful": {
        "rating": "-50",
        "description": null
    },
    "Ifinity": {
        "rating": "-40",
        "description": "CurrentOldOlder\nThe current icon is a extremely dark purple box, with a vivid purple infinity symbol in the middle. Finally, there is a darkish purple notder, which is significantly more bright than the rest of the icon.\nIt is the same as the current icon, but there are cracks in the infinity symbol, the notder is darker, and the infinity symbol is darker.\nThe older icon is represented with a light grey box, with a white notder, and a black infinity symbol, plus a relaxed emoticon."
    },
    "Instant Win": {
        "rating": "'''<big>-31</big>'''",
        "description": null
    },
    "Excavation Chain": {
        "rating": "-6.125 to 172.125",
        "description": ""
    },
    "Millisecondless": {
        "rating": "-30",
        "description": " Millisecondless is a difficulty in Baseline Class 0 with a rating of -30, placing it after Instant Win, Millisecondless’ predecessor, and the final class negative difficulty, but placing it before Win, Millisecondless’ successor. It also does have a sub-difficulty, Astronomical, however, you'll see more about that in it's own page. This difficulty also has a Kol Metris rating of approximately |0.5|, meaning that it in the middle/near the middle of the Relax through Automatic range of difficulty. This difficulty is humanly possible, meaning that literally anyone, even you, could potentially beat this. However, this difficulty is Baseline Class 0, meaning that it is basically unlosable, and the only way that you can lose is by disconnecting, or by bugs happening.\nA victor of a Millisecondless would be considered by all means, legit, since there is no possible way that you could hack a victory of this difficulty. Any attempts at hacking would either be for fun, or just plain scummy, since towers with this difficulty can usually be beaten within mere milliseconds of entering the tower portal.\nTowers of Millisecondless would be recommended to have the floor as a winpad, as well with having the spawnpoint be directly on said winpad, with atleast 9 studs distance of fall time. Anything further than 9 studs of falling time would count as an obstacle of this difficulty, and anything less than 9 studs of falling time would count as an obstacle of the previous difficulty, Instant Win."
    },
    "Astronomical": {
        "rating": "-29.5",
        "description": null
    },
    "Winsome": {
        "rating": "-28",
        "description": null
    },
    "Do Nothing": {
        "rating": "-27",
        "description": "Do Nothing is a Class 0 difficulty that succeeds Winsome, but preceeds Sleepful. Like the name says, you do nothing. This difficulty is pretty quick, and even if you look away or blink slightly, you'd miss it, at least on the lower parts."
    },
    "Sleepful": {
        "rating": "-26.5",
        "description": null
    },
    "Blessing": {
        "rating": "-26",
        "description": null
    },
    "Vintage": {
        "rating": "-25",
        "description": null
    },
    "Ifinitude": {
        "rating": "-24.5",
        "description": null
    },
    "Just Air": {
        "rating": "-24",
        "description": "Just Air is a Class 0 difficulty that is represented with a sky blue background and a digitally-written white 'H'. You could try this after Win or Do Nothing, since the point is you just fall into a winpad, if not be elevated into one. If you think you are going to lose this, you are wrong. air go brr (made by notaltar/Veblicon at 28th october 2020."
    },
    "Happylike": {
        "rating": "-23",
        "description": null
    },
    "Locomotion": {
        "rating": "-22",
        "description": null
    },
    "Walkthrough": {
        "rating": "-21",
        "description": null
    },
    "Automatic Joyful": {
        "rating": "-20",
        "description": "You probably either looking at the screen do absolutely nothing or AFK right now. You just beat Walkthrough like less than a three quarters of a minute without pressing any single key. Well welcome to another unfailable difficulty Automatic Joyful"
    },
    "Unlosable": {
        "rating": "-19",
        "description": " Unlosable is a Class 0 Difficulty with a rating of -19, coming after Instant Win, and before Automatic. Due to it being one of the original C1 difficulties, it has had many difficulties before and after this, and also many sub difficulties in its lifetime. However, it currently only has 2 unofficial sub-difficulties (both of them being variations), with them being Roll and Mazeophobia. Anyway, you should easily be able to ace this, due to it being similar to nerfed Automatic, and therefore there is a minimal chance of accidental failure."
    },
    "Shattered Babass": {
        "rating": "-18.5",
        "description": " Shattered Babass is a Class 0 Difficulty coming before Automatic but is after Unlosable, Roll or Mazeophobia This difficulty is the second last automatic difficulty behind obviously Automatic. Shattered Babass is basically too easy so just skip to Class 1, or even Class 2, but if you ACTUALLY SUCK then stay here for now, actually you know what, skip to Automatic . There is no reason to be on this sub-difficulty (if you aren't in a DCT, that is)."
    },
    "Frivolous": {
        "rating": "-18",
        "description": null
    },
    "Vibeness": {
        "rating": "-17.5",
        "description": null
    },
    "Automatic": {
        "rating": "-17",
        "description": "Welcome to Automatic, <INSERT USERNAME HERE>! also known as a very boring difficulty. But that's fine, because it is very easy! Actually, you don't even need to do anything to beat this difficulty! Just sit back and watch your Roblox character get pushed to the winpad/teleporter! It is a.. Very boring experience, but. You'll get to the hang of it. Have fun! That was ironic by the way..."
    },
    "Spontaneous": {
        "rating": "'''<big>-16</big>'''",
        "description": null
    },
    "Joyful": {
        "rating": "-15",
        "description": "Joyful is a Class 1 difficulty created for the JET Chain. It is a difficulty between Automatic and Press a Key (or Placid). This difficulty also only has one sub difficulty: Do Something.\nObstacles in this difficulty only requires a single in-game action to complete. The rest of the obstacles in Joyful are similar to Automatic. Joyful USED to contain really slow and boring conveyers as well to the point where you'll just do multiple actions instead, but I guess it's gone now.\nLike other Class 1 difficulties, this difficulty is almost never a challenge to the player. It is recommended that you skip these time-wasting difficulties and move on to attempting something similar in difficulty like Tower of Annoyingly Simple Trials instead."
    },
    "Do Something": {
        "rating": "-14.5",
        "description": null
    },
    "Placid": {
        "rating": "-14",
        "description": null
    },
    "Press a Key": {
        "rating": "-13",
        "description": null
    },
    "Tap to Move": {
        "rating": "-12.66",
        "description": null
    },
    "Walk A Slope": {
        "rating": "-12.33",
        "description": "Slopes are used for everything from obbies to roofs for buildings to escalators. But in this difficulty, you will be learning about walking through different types of slopes, from steep to wide. Slopes look like a rotated (often by 45 degrees) part that you can walk on, and thus you are able to gain speed by walking down a slope (only in real life) because of your momentum. You may also learn to do harder variants of obstacles you have previously done (like climbing a truss or walking), but the next difficulty will challenge you to use your skills on these new obstacles you have learned through this class. WAS is a Class 1 difficulty consisting of a slope-walk. "
    },
    "Climb A Truss": {
        "rating": "-12",
        "description": "Climb A Truss (CAT) is a baseline Class 1 difficultysometimes considered a sub-difficulty (in DCTs) rated -12 in the Main Difficulty Chart which follows Press a Key and its sub-difficulties, but is placed before Jumpless, as well as this difficulties sub-difficulty. It is a pretty simple difficulty, as all you need to do is climb a truss. The truss can vary in size, however, and can be anywhere from 4 studs long up to 10K studs long, where you'd have to hold the W key for a while."
    },
    "Tranquil": {
        "rating": "-11.5",
        "description": null
    },
    "Starter": {
        "rating": "-10",
        "description": null
    },
    "Cakewalk": {
        "rating": "-9.5",
        "description": "Cakewalk is a Class 1 difficulty that explains itself immediately after the title is read, it being a cakewalk. It is between Starter and Sweet difficulties, and it should be attempted after you mastered the controls. \nThe word Cakewalk by definition means a very straightforward, easy path/walk. Cake is also pretty happy as you encounter it at anyone's birthday party, so there's that fact. Anyways, since this is a Class 1 difficulty, it is very easy and is recommended to do if you, and to put it nicely, aren't the best at obbies. It also is quite short and easy to the point that you only need to press 15 keys to 30 keys without any inputs from your spacebar. \nThis difficulty is called Cakewalk, not cake jump."
    },
    "Sweet": {
        "rating": "-9",
        "description": "Sweet is a Mid Class 1 difficulty on the Difficulty Chart. This is when the difficulty really starts to ramp up as now you must complete multiple obstacles that involving the following:\nJumping multiple times throughout the difficulty\nWalking most of the time throughout the difficulty, meaning you actually have to use your keyboard.\nAvoiding holes that are escapable.\nAnd much more. Any towers or obbies in this difficulty should be attempted after you've beaten a Starter or Cakewalk difficulty obby and/or tower."
    },
    "Sugary": {
        "rating": "-8.66",
        "description": " Sugary is a Mid Class 1 sub difficulty of the so called Sweet which is i think you know is harder than basic Cakewalk,though it's harder than Aesthetic or Lovely if you're the type of guy that only wants to beat the level, this difficulty like other class 1 difficulties require almost no skill, while beating those you won't even notice and you're already at Class 2 or even Class 3 if you're a pro obbyist, you can enjoy these moments until you meet something like Horrific or even Nightmare (good difficulty)"
    },
    "Aesthetic": {
        "rating": "-8.33",
        "description": null
    },
    "Glee": {
        "rating": "-7.5",
        "description": " Glee is a High Class 1 sub-difficulty, surpassing Lovely, yet preceding Flowerness. It also had one sub-difficulty, called Stone, in the excavation chain.\n Glee used to be located in Mid Class 0 (before TDEx), as a successor to Tranquil (JCC), and meanwhile was a predecessor of Heavenlike. However, this difficulty was transferred from JCC to JJT, and will reside here from now onwards.\nDue to its placement, essentially anyone can beat this difficulty. It consists of very basic obstacles, which are extremely easy and you will most likely get bored while playing this difficulty. You should move into something harder, like Effortlessless, or maybe even Effortless, or you can just stay on this difficulty."
    },
    "Flowerness": {
        "rating": "-7",
        "description": null
    },
    "Coasterifying": {
        "rating": "-6.66",
        "description": "Coasterifying is a Mid Class 1, ranked -6.66, is a sub-difficulty in-between other main difficulties, Flowerness and Pleasant (or ADND) Created on May 2, 2023 by Bryan, Coasterifying has no sub-sub-difficulties, decal, or music. Lastly, Coasterifying isn't in any chains, hasn't been revived, revamped, or removed.\nCoasterifying is classified as a humanly possible difficulty, being in the first class that does so. This is an incredibly easy difficulty, meaning hardly anyone should fail.\nThis difficulty includes a gimmick, the fun nature of a Roller-Coaster! It could be calm, with a smaller height, or a bit taller, like a replica of Fury 325. It doesn't matter about speed, height, or boosts, it matters about the difficulty. If you have a difficulty with a loop, for example, you might need railings, like this ( ). Without, it might be Piece o' Cake, or Pleasant, which is harder then the actual difficulty.\nAdding on to the gimmick, there is only one type of coaster you can use, because the other is Automatic. I call the type a \"Control-A-Cart\", which is pretty much obby creator, or cart ride games. Obby creator is slightly different, because it has a speed shift.\nObstacles are nil (NOT THE DIFFICULTY) in this difficulty. It's all coaster. You can use anything in your coasters, like inversions (WITH RAILING), sharp turns and steep (not really) drops. Only inversions have railings above them. If there's a steep drop or a sharp turn, theres no railings "
    },
    "A Difficulty Named Difficulty": {
        "rating": "-6.33",
        "description": null
    },
    "Pleasant": {
        "rating": "-6",
        "description": " Pleasant is a Class 1 Difficulty, being very well known, due to it originating from JET. As such, you will see this difficulty crop up in most DC towers, and even fangames as well. This is the last official difficulty of Class 1. You barely need to do anything here, it’s that easy. It is also beyond Lovely but before Tutorial.\nHowever, it is after Flowerness, but before Piece o' Cake in the Unofficial Chart. Obstacles in this difficulty are very basic, due to the fact that client objects could over-inflate the difficulty, leading to the placement being inaccurate. "
    },
    "Piece o' Cake": {
        "rating": "-5.5",
        "description": null
    },
    "Tutorial": {
        "rating": "-5",
        "description": "Hello, player! Welcome to the tutorial in high Class 1! By now, you should have completed a Pleasant obby or tower. Now that you are here, it is time to take on the Tutorial difficulty. This difficulty will attempt to teach you everything you need to know to take on later difficulties. Are you ready?"
    },
    "Hellish Encore": {
        "rating": "-4.66",
        "description": null
    },
    "Delightful": {
        "rating": "-4.33",
        "description": null
    },
    "TooEasy": {
        "rating": "-4",
        "description": " TooEasy is a Class 1 difficulty that is harder than Tutorial and easier than Peaceful. It's the final difficulty of High Class 1 and has a rating of -4. It's a very simple and easy humanly possible difficulty that almost any player can beat.\n TooEasy's name references how it is one of the easiest difficulties. Almost all Difficulty Chart obby players and all JToH obbyists would find this difficulty a cakewalk. Even Mega Fun Obby players would be able to beat this difficulty.\nThe difficulty would have a tier 0-1 if this used the Tier rating. However, it would land a Kol Metris rating of |~12-13| due to its placement."
    },
    "Peaceful": {
        "rating": "-3",
        "description": " Peaceful is a Low Class 1 difficulty represented with a light greyish purple color making up a smile with a brighter shade. It's easier than Playful (its sub-difficulty) and Magnificent, but harder than TooEasy. Hindrances in this difficulty are usually elementary, and should be accomplished easily by everyone.\nNow you have to start jumping here, and complete basic obstacles along your way."
    },
    "Playful": {
        "rating": "-2.5",
        "description": null
    },
    "Magnificent": {
        "rating": "-2",
        "description": " Magnificent is a Peak Class 1 Revived Classic Difficulty, that sits between Peaceful and Effortlessless (or Facile) . Obstacles are extremely easy, so easy that you won’t feel any sort of challenge in this difficulty. "
    },
    "Facile": {
        "rating": "-1.5",
        "description": null
    },
    "Effortlessless": {
        "rating": "'''<big>-1</big>'''",
        "description": " Effortlessless is a EET difficulty, located in Peak Class 1. This difficulty is the final barrier before the EToH difficulties, being easier than Effortless, but harder than Magnificent. This is the first difficulty with actual obstacles in it, just imagine any obstacle that could be beaten by anybody. \nIt is not a joke like most of the other lower difficulties, but rather now can be played by beginners who have little to no experience with obbies. You won't struggle here, and you will easily get to the next difficulty. This is like a \"tutorial\", because there are now new jumps instead of simply holding keys. \nYou're likely going to win, most people do not find this as a challenge. This is the difficulty a newbie should start at if they're experienced at Roblox. Difficulties placed lower than this may be a good training tool for AI."
    },
    "Gravel": {
        "rating": "-0.5",
        "description": "Gravel is a low class 1 sub-difficulty of Effortlessless, a difficulty from JET and precedes Effortless, a removed JToH difficulty. This difficulty is one of the easiest difficulties with actual obstacles, and can be beaten by the majority of the Roblox obbyist population. \nThis difficulty is very welcoming to beginners, as it can be beaten by almost anyone with any experience in obbying. Towers in this difficulty are often very forgiving, being filled with safety nets and not being meant to \"stop\" you, but give you a fun experience. \nLike the previous few difficulties, you are very likely to succeed in beating this difficulty, as this difficulty features very easy and simplistic jumps that can be performed without any effort. Many obby games out there, such as generic \"ESCAPE THE ___\" obbies and Mega Fun Obby are around this difficulty and/or Effortlessless."
    },
    "Effortless": {
        "rating": "0",
        "description": null
    },
    "Playground": {
        "rating": "0.33",
        "description": " Playground is a baseline class 2 official sub-difficulty of Effortless. It follows its main difficulty, Effortless, but precedes Effortless's other subdifficulty ( Simple) and other main difficulties like Easy. Given that it's a lower-end class 2 difficulty, it should be fairly easy and fun to complete for the average obbyist, even with needing more effort than Effortless."
    },
    "Simple": {
        "rating": "0.66",
        "description": null
    },
    "Easy": {
        "rating": "1",
        "description": null
    },
    "Neat": {
        "rating": "1.25",
        "description": " Neat is the sub-difficulty of the Baseline Class 2 (C2) difficulty Easy below Calm, with its exact difficulty rating being between 1.25 and 1.49.\nThis difficulty was initially meant to be the difficulty for the Eternal Towers of Hell (EToH) Mini Tower, Not Even A Tower (NEAT). However, due to balance changes in the Main Difficulty Chart, NEAT then became Switch difficulty instead, since its exact difficulty rating was 1.83 at the time. Later, slightly after the EToH Ring 1 revamp, NEAT was moved to 1.12, which changed NEAT's position to merely Easy.\nAdditionally, this difficulty was created by Dreadful.exe, and was revamped twice by IdklolXDXDXD and Astrominal respectively. And, this difficulty, despite its theming, is not a joke difficulty."
    },
    "Calm": {
        "rating": "1.5",
        "description": "Keep in mind that due to the variance of obstacle difficulty, these generally should not be used as a basis for obstacles.\nBottomLowMiddleHighPeak\nBottom Calm\n4.65 stud jump (C)\n4.50 stud jump (UC)\n1.95 stud squeeze\n1.55 stud wraparound (C)\n1.40 stud wraparound (UC)\nLow Calm\n4.75 stud jump (C)\n4.60 stud jump (UC)\n1.9 stud squeeze\n1.65 stud wraparound (C)\n1.50 stud wraparound (UC)\nMiddle Calm\n4.85 stud jump (C)\n4.70 stud jump (UC)\n1.85 stud squeeze\n1.75 stud wraparound (C)\n1.60 stud wraparound (UC)\nHigh Calm\n4.95 stud jump (C)\n4.80 stud jump (UC)\n1.80 stud squeeze\n1.85 stud wraparound (C)\n1.70 stud wraparound (UC)\nPeak Calm\n5.05 stud jump (C)\n4.90 stud jump (UC)\n1.75 stud squeeze\n1.95 stud wraparound (C)\n1.80 stud wraparound (UC)"
    },
    "Switch": {
        "rating": "1.75",
        "description": null
    },
    "Medium": {
        "rating": "2",
        "description": null
    },
    "Normal": {
        "rating": "2.25",
        "description": " Normal’s icon is represented with a light yellow background and a 16-bit worried black emoticon. It’s simple and gets to the point. "
    },
    "Intermediate": {
        "rating": "2.5",
        "description": null
    },
    "Rewardable": {
        "rating": "2.75",
        "description": "“\nYou have beaten Intermediate. And so, you have come into your new level. Where there is a amazing ability which could help you with your journey. Welcome to the \nRewardable shop! This is where you could boost yourself up with an amazing ability potion. Earn points by beating each obstacles! Even beating other difficulties that are above this still receive a point! How amazingly!\n”\n- \nRewardable\n Rewardable is a sub difficulty that is located in Low Class 2. This difficulty lands in-between Intermediate and Hard. It was created, and is still being created, on 6/27/2022 by OqYTRXD.\nThis difficulty is one of the friendliest difficulties, unmatched by any other nice difficulties. The reason why this difficulty has that rank is because of a special ability it has: the shop. \nEvery obstacle the player attempts will give the player points. The number of points you get depends on whether you attempted or completed the obstacle. The points allow you to buy things that can help you to continue your difficulty journey. However, there is a downside to it. Every ability that pitches in with the player will NOT last long. Once the player dies, their ability will no longer help them. To get the ability back, you will have to beat even more other obstacles, and you can buy it again.\nWhether you’re attempting a room, floor, steeple, tower, etc, this difficulty is really easy to do. Accomplishing this difficulty requires basic problem solving and fast trials. So, in this difficulty, that is essentially it. We shall move on."
    },
    "Tricky": {
        "rating": "3.5",
        "description": " Tricky, a Mid Class 2 difficulty, stands as a unique challenge positioned between High Hard and Low Difficult. As it maintains its position as one of the somewhat demanding difficulties within Class 2, it is recommended to tackle towers in this category only after mastering all towers at and below the Hard difficulty level.\nFanmade obbies with this difficulty tend to contain traps and other unexpected diversions, similar to that of Tower of Traps or Tower of Insult to Injury. These traps can either be harmless or harmful, depending on the obby's creator. \nAlso, the difficulty range for Tricky is 3.5 - 3.99."
    },
    "Strenuous": {
        "rating": "4.5",
        "description": null
    },
    "Irritating": {
        "rating": "5.25",
        "description": null
    },
    "Maniacal": {
        "rating": "5.5",
        "description": " Maniacal is a Class 2 difficulty that is inbetween Challenging and Intense. Oh, it also formerly had a sub difficulty called Traverse Through a Tight Maze With a KIllbrick Spinner. It consists of difficult gameplay that can irritate the majority of players, including talented obbyists. If you are not cautious, you will most likely fall off.\nThe vast bulk of obstacles are hard obstacles and motions that, if not done properly, can lead to failure. Anyone attempting a Maniacal difficulty tower should practice first."
    },
    "TooMedium": {
        "rating": "6.25",
        "description": null
    },
    "Severe": {
        "rating": "6.5",
        "description": null
    },
    "C0RrUpT": {
        "rating": "7.5",
        "description": null
    },
    "Relentless": {
        "rating": "'''<big>8</big>'''",
        "description": null
    },
    "Category": {
        "rating": "1.15 to 197.5",
        "description": null
    },
    "Thanos (Difficulty)": {
        "rating": "9.25",
        "description": null
    },
    "Madness": {
        "rating": "9.5",
        "description": "Madness’ icon is very simple, it’s just a blue square lighter than that of Insane, but darker than that of Extreme.\nFor its alternate icon, it’s a darker blue background with even darker blue stripes and a black :P face on it."
    },
    "Classical": {
        "rating": "9.75",
        "description": null
    },
    "Turmoil": {
        "rating": "10.5",
        "description": null
    },
    "Absurd": {
        "rating": "10.75",
        "description": null
    },
    "Horrifying": {
        "rating": "11.33",
        "description": "Horrifying is a Mid Class 3 Soul Crushing Sub-Dificulty of Terrifying. You should try to do these towers after completing a Terrifying tower. Just note that this is insanely hard.\nAlso, this difficulty is nearly humanly impossible because it is in class 3. One of the warnings for a tower of this difficulty is, \"NEARLY IMPOSSIBLE\" and, \"NOPE, YOU ARE NOT BEATING THIS ON MOBILE\" due to how hard it is. Good luck."
    },
    "Petrifying": {
        "rating": "11.5",
        "description": null
    },
    "Champion's Road": {
        "rating": "12.125",
        "description": "You’re at the last sub-difficulty of Catastrophic, and the last tower difficulty alive. Welcome, <INSERT USERNAME HERE>. You are now in the sub-difficulty known as Champion’s Road, which is the difficulty form of the JToH tower Tower of Champion's Road (ToCR). It is located in Mid Class 3 as a sub difficulty and the normal difficulty Horrific. This difficulty contains gameplay & design similar to Tower of Champion's Road.\nThis difficulty is still humanly possible, but extremely challenging, requiring great precision only the best of obbyists are capable of. Only true champions will surpass this, and the champion's road is (very likely) for you."
    },
    "Eccentric": {
        "rating": "12.5",
        "description": " Eccentric is a High Class 3 in between Catastrophic and Horrific that represents the high range of Catastrophic to the borderline between Catastrophic and Horrific . It is also the final difficulty before you enter the high range of class 3. Due to it's placement, this difficulty is borderline impossible, and should only be attempted by the most elite of obbyists, however, individual jumps are still manageable provided you are at a high skill level. \nIt is recommended to practice on this difficulty as there isn't any luck related elements to it, just raw skill, either way, you will see stuff that is MUCH worse then this later down the line, but that doesn't matter right now. For now, you should just improve on your skill, and then improve in other obby related aspects like nerve control or anger management before attempting a tower of this difficulty. Good luck!"
    },
    "Horrific": {
        "rating": "13",
        "description": null
    },
    "Reversed": {
        "rating": "13.25",
        "description": ""
    },
    "Eternal": {
        "rating": "13.5",
        "description": null
    },
    "Treacherous": {
        "rating": "14.33",
        "description": "This is it. You’ve come across the Final humanly possible difficulties. Not far from this is The Human Limit, and past that is.. well, a realm of human impossibility.\nI wish you luck. You will experience treachery. This is the first final challenge for you. The next ones include Supreme, MegaDeath, and The Final Difficulty."
    },
    "HYPER": {
        "rating": "14.66",
        "description": " Hyper is a Peak Class 3 sub-difficulty and the second Sub-Difficulty of Unreal and last sub-difficulty from Humanly Possible classification. Hyper is nearly humanly possible because a person by the name of LiteratureDesk beat Citadel of Infinite Void (as the first ever victor in an unreal tower), which means a Hyper tower can be beaten. Hyper is in-between Unreal and Anguish, but if you're counting the sub-difficulties from unreal, it's only previously Treacherous since Hyper is the last sub-difficulty. Hyper have a variation that is slightly harder, which is True Hyper, it was a sub-difficulty of DEATH, located at Class 4. True Hyper difficulty was made all the way back in 2020, created by upseguest (in GCoCIaND).\nHyper can be pretty unique, because it can be as ____-ly Hyper or without -ly, take a example of Easy. If you add Hyper on the name, it will turn out \"Easily Hyper\", The hyper version of Easy will be approximately around the Intense range, it can result that hyper possibly has almost infinite amount of sub-difficulties, possibly making this difficulty the largest amount of sub-difficulties, the first appearance about hyper variations was Monolith of Deadly Difficulty Cluster. Most often though Hyper sub difficulties span from Insanely Hyper to Catastrophically hyper, and sometimes up to Unreal Hyper. The sub-difficulty of Hyper that is fused with itself is called Hyperbolic (eg. \"Hyper-ly Hyper\")"
    },
    "Anguish": {
        "rating": "15",
        "description": null
    },
    "The Human Limit": {
        "rating": "'''<big>15.5</big>'''",
        "description": " The Human Limit (THL), originally known as Zilch, is an official sub-difficulty in Class 3 or in Alternate Difficulty Chart standards, it is a Peak-Class 3 sub-difficulty, located in-between Anguish & nil. Any tower designed to be humanly-impossible or just beyond this, will be placed in nil or above.\n The Human Limit, hence it's name, is the absolute peak of human capability in-terms of skill. Anything beyond this will very well be humanly impossible, obstacles of this difficulty require precision, accuracy, timing & posistion which test human capabilities and are actually borderline-impossible, these obstacles are actually extremely tough & can take tons of experience, practice & skill even for an elite obbyist. Sometimes obstacles are near frame-perfect due to the immense timing, posistioning and precision you need to even accomplish one of these jumps. Unfortunately, no player has ever acquired the skillset and such reaction time to even complete a single tower of this difficulty."
    },
    "nil": {
        "rating": "16",
        "description": null
    },
    "Jank": {
        "rating": "16.33",
        "description": "Jank is one of the sub difficulties of Nil. It resides near the Peak phase of nil, so you can see similar challenges compared to the Citadel of Void. It is the successor of nil but before the infamous Heart of Void or eRRoR. Even the best obbyists might give up trying to grind this due to the unfair and uncomfortable nature of the obstacles.\nA normal tower contains instakill floors and unfair wallhopping sections combined with uncomfortable gameplay and tight squeezes. These obstacles prevent even the most skilled to make it far. Imagine taking the Citadel of Void and buffing floor 19 to mid Remorseless. Now you will have a Citadel of Void that classifies as Jank.\nEven though beating this legit will not happen anytime soon, it doesn't mean it couldn't be beaten by someone. You can use blessed coil or TAS to help you get past obstacles. Beware that with TAS, it won't be a total cakewalk, as you still need to manually do the jumps it is just designed so that you can do the same jump over and over again."
    },
    "The Heart of Void": {
        "rating": "16.66",
        "description": "The Heart Of Void is a Baseline Class 4 humanly impossible Sub-Difficulty made by Real The Gamer. It is harder than nil or Jank but easier than eRRoR. Obstacles in this difficulty require near-perfect precision and skill, which is why towers of this difficulty are not recommended to attempt without the use of items.\nThis difficulty used to be the transitioning point between nil and eRRoR. However, newer difficulties such as Nightmare were made which took that position away from Heart Of Void. Also it is a sub dificulty from eRRoR."
    },
    "Nightmare": {
        "rating": "17.33",
        "description": " Nightmare is a Low Class 4 difficulty, represented by a gradient of black-grey-black. It is humanly impossible to beat, and may stay unbeaten for a couple of years. Nightmare is not recommended for all obbyists, unless you're using Tool Assisted Speedrun, or any helpful tools. Nightmare is a successor to nil, and is more difficult to beat than it. However, it's also a predecessor of eRRoR, and is more simple and easier than it. \n Nightmare incorporates jumps that are extremely luck-based and require utter precision movement. Because of that fact, it is recommended to use TAS if you want to try a tower of this difficulty out, just an absolutely minuscule or even a nanoscopic mistake can cost you tremendous amount of progress or even your entire run due to the nature of the obstacles and how challenging those actually are. \nBeating, or even completing, a floor of Nightmare is a huge accomplishment, and takes an unfathomable amount of skill to use. Although this difficulty seems humanly impossible (because it literally is), it is nothing compared to difficulties like eRRoR or Why.\nTo accomplish completion of a Nightmare difficulty tower, you would need prodigious luck and skill that no actual obbyist possess at the moment. Nightmare as of now, describes towers that are only possible with TAS, but it may possibly change one day, but probably not anytime soon.\nIf one decides to attempt a Nightmare difficulty tower, it is recommended for them to use a Bootleg Coil, or if someone has an extreme lack of skill they would use Vertical Mobility, otherwise they are most likely to fail at the first floor. \nNightmare is measured to be around Tier 18 or possibly elevated, which expedients the factuality that this difficulty is basically impossible to beat without tools, exploits, and other gadgets."
    },
    "Literal": {
        "rating": "17.66",
        "description": null
    },
    "WHY": {
        "rating": "18",
        "description": null
    },
    "MAXIMUM OVERDRIVE": {
        "rating": "18.5",
        "description": "Maximum Overdrive is a difficulty that is reserved for Towers with obstacles that require more broken physics than Why difficulty. This is potentially the absolute limit of difficulty that humans are capable of doing. (The Human Limit now)\nThe origin of this difficulty was made by an unknown player from Sandbox (2) back in 2018, originally it was called \"Borderline Impossible/True Borderline Impossible\" but was later renamed to this. A single jump of this difficulty is already more difficult than the entirety of Tower of Spiralling Fates.\nSPONGEBOB SQUAREPANTS RIPOFF\nThe range of the difficulty stems from High Why difficulty to Low No."
    },
    "Purgatory": {
        "rating": "19.5",
        "description": "<INSERT USERNAME HERE>, I see you have gone long past The Human Limit, and you have now entered Purgatory, the zone between Heaven and Hell. \n Purgatory is a Low Class 4 Humanly Impossible Difficulty, which has originated from HelloArt’s Extended Difficulty Chart. This was originally the replacement for HAEDC’s The Borderline Chain, and since Class 4 is now unlocked for you to freely add to, it has now been made into a difficulty apart of more than just UoFTE and HAEDC. It succeeds the heinous No, and precedes the equally cataclysmic DEATH, and this also has one sub difficulty, called Captivity (Only in HelloArt's Extended Difficulty Chart though). \nMoving on from that, this difficulty requires absurd effort incapable by obbyists, and it will remain like that for years and years, potentially until Roblox’s death. Thus, this is classified as ‘Humanly Impossible’, and you should use tools such as Tool Assisted Speedrun (abbreviated as TAS) and the Bootleg Coil on difficulties like this, and anything harder. \nEven so, singular jumps of Purgatory are capable of being completed, given time and effort amassed, but even just singular floors of this certainly are not possible. You would need a very high consistency of being able to do jumps like this to beat a difficulty of this sort, as this difficulty not only has incredibly difficult jumps, but also is incredibly punishing, meaning if you even make just a nanoscopic mistake on any section, you would fall to your doom and lose all of your progress."
    },
    "DEATH": {
        "rating": "20",
        "description": null
    },
    "Nullifying": {
        "rating": "21",
        "description": " Nullifying is a Low Class 4 Difficulty residing inbetween DEATH and HELL. Being Class 4, this difficulty is extremely impossible and should not be attempted. \nThis difficulty is humanly impossible, meaning that only TAS can do it, humans cannot. This difficulty is also the beginning of the XD Chain, a 10 difficulty long chain spanning from the end of Low Class 4 to the end of Mid Class 4, or alternatively; Nullifying to CALAMITY. (and also Killjoying) \nThis difficulty, since it is in the XD chain, is a buffed version of a specific difficulty. In this case, the difficulty that is buffed is Insane, the 8th difficulty on the JToH Chart, with a rating of 8, or alternatively; the beginning of class 3, with a rating of 9. "
    },
    "HELL": {
        "rating": "22",
        "description": null
    },
    "Vortex": {
        "rating": "22.5",
        "description": " Vortex is a Class 4 Difficulty, located in the middle section. It surpasses the XD chain and JHT difficulty HELL, yet precedes the other XD chain and JHT difficulty TARTARUS. This difficulty is absolutely impossible, due to being at the end of Class 4, and you should only be able to beat this featuring a maximally precise and powerful Tool Assisted Speedrun, along with other items, like the Blessed Coil and the Forcefield if necessary. (You can also use Vertical Mobility)\nThis difficulty is beyond the tier system, estimated to be at an estimated tier level of beyond Tier 30, which expedients the impossibility of this difficulty. If you were to even surpass ONE jump of this, it would be an achievement that would remain unbeaten for years in the Roblox community.\nYou’d need ungodly amounts of luck, and extreme amounts of depth in research, and even just a jump requires months of research to surmount, as said earlier. However, even though this is still extremely hard, it is still literally nothing compared to difficulties like TARTARUS."
    },
    "TARTARUS": {
        "rating": "23",
        "description": null
    },
    "CALAMITY": {
        "rating": "24",
        "description": " CALAMITY is a Mid Class 4 Humanly Impossible difficulty after TARTARUS. Obstacles here are more Pixel Perfect and RNG Based than TARTARUS, but not as physic-breaking as Unimaginable.\n CALAMITY is in-between of TARTARUS and Unimaginable. It is also near the end of the \"XD\" Chain, a difficulty chain spanning from the end of class 4 to the beginning of class 5. or more understandably from Nullfying to CALAMITY."
    },
    "Neutralize": {
        "rating": "24.33",
        "description": " Neutralize is a mid class 4 humanly impossible sub-difficulty that is apart of CALAMITY. Its most often used to describe the midrange of CALAMITY which is 24.25 to 24.49 on the difficulty scale. \n\"Good luck traveler, as to do this legitimately, you'll need a wide knowledge of different skills such as wraparounds, trusses, and many, many glitches. Class 4 is not for humans to complete, and it isn't for you to complete either. However, you completed CALAMITY, so who knows?\""
    },
    "Killjoying": {
        "rating": "24.66",
        "description": "Killjoying is a low-mid Class 5 humanly impossible difficulty of CALAMITY. Obstacles in here are so hard that without TAS, this difficulty is impossible.. This difficulty is harder than Neutralize, This is the XD chain, or super-buffed variant of Unreal, and is the fourth hardest difficulty in the XD chain."
    },
    "Unimaginable": {
        "rating": "25",
        "description": null
    },
    "Dimension": {
        "rating": "25.5",
        "description": null
    },
    "Omega": {
        "rating": "26",
        "description": " OMEGA (designated as OMEGA) is a difficulty a lot harder than Unimaginable, but is easier than SUFFER in the main chart or Malicious here. All obstacles in this difficulty are extremely obscure, as with any difficulty above TARTARUS.\nTowers in this difficulty need to take around months to make, as it’s difficult to not only calculate individual jumps extensively, but to even think of new ones. Verifying a tower here though is on a whole new level, taking many months to even years. \nSome also consider this the first physically impossible difficulty, although this attribution is debated in the community, mostly alongside Malicious and Supreme (or what comes after them, specifically.)"
    },
    "DisarrayText2.png": {
        "rating": "26.5",
        "description": null
    },
    "SUFFER": {
        "rating": "27",
        "description": " SUFFER is a Class 4 Difficulty which succeeds Omega, but precceeds Aleph-Null or CHAOS.\nSuffer is notorious for tormenting glitches. As an example, a book glitch wrap or a very fast falling platform on top with an instakill at the bottom. Making significantly tougher and generally more impossible than Omega, but however, remaining easier than Aleph-Null or CHAOS."
    },
    "CHAOS": {
        "rating": "27.5",
        "description": null
    },
    "Aleph-Null": {
        "rating": "28",
        "description": null
    },
    "Mystical": {
        "rating": "28.33",
        "description": " Mystical is a Peak Class 4 sub-difficulty with a rating of 28.33. Said rating places this difficulty in-between Aleph-Null and Immeasurable, or next Aleph-Null sub-difficulty Reality. Along with a rating, Mystical has a rating range of 28.33.\n Mystical‘s tier rating would be an estimated low tier 28. This means that all tiered obbies of this difficulty are Humanly Impossible.\nAny attempt at beating a tower of Mystical difficulty would likely result in failure. This is because this difficulty, as mentioned before, is in the Humanly Impossible range.\nExamples of jumps in towers of Mystical difficulty include but are not limited to 15.1 stud climbable jumps, 13.75 stud wraps, and 7.5 stud walkarounds."
    },
    "Reality": {
        "rating": "28.66",
        "description": "Reality is a class 4 difficulty that is sure to end your reality, or at least keep you in check for a long time. It is harder than Aleph-Null and Mystical, however, it is easier than Immeasurable. The floor is dark, and the fog will also overtake you into nothingness. If you somehow even locate the obstacles in this difficulty, you’ll find that they are not allowed to be messed with. They are unbelievably hard, and, combined with the darkness, you’ll have trouble even scouting the jump for your TAS. This floor is sure to be a huge roadblock in your journey."
    },
    "Immeasurable": {
        "rating": "29",
        "description": null
    },
    "Noxious": {
        "rating": "29.5",
        "description": "Noxious is a Class 4 sub-difficulty, located at the top of the class. It takes place after Immeasurable, but before Malicious. It is also the last difficulty until the last JHT difficulty. Obstacles of this difficulty require numerous mastered techniques, as well as luck. Towers of this difficulty are impossible to beat without any tools. \nVerifying an obstacle of this difficulty is nearly impossible, and will take a huge amount of attempts. "
    },
    "Malicious": {
        "rating": "<big>'''30'''</big>",
        "description": "Malicious is the final canon difficulty in JToH’s Hardest Towers, the penultimate canon difficulty on the Simplified Difficulty Chart, and the final main difficulty of Class 4. This difficulty is even harder than Immeasurable. This difficulty is defined within the SDC as an arbitrary fluctuation of Tool Assisted Superplay’s peak usability\nThis is a highly significant difficulty within JToH’s Joke Towers as it was formerly the end of enigmatically (Note: this meant physically at the time.) possible gameplay, and sprouted the seeds for which a majority of the backbone of the MDC was laid upon, as well as the inspiration for many different difficulties, the most major of which being Malicious-Zeta and Malicious Core.\nThe obstacles in this difficulty can range from simple things such as 15 stud jumps to having to do a glitchwrap-jump through a 1 stud maze to land on a truss 18 studs away."
    },
    "Autism": {
        "rating": "30.33",
        "description": null
    },
    "Malevolent": {
        "rating": "30.66",
        "description": null
    },
    "Building": {
        "rating": "31",
        "description": null
    },
    "Under Construction": {
        "rating": "31.5",
        "description": null
    },
    "Does Not Compute": {
        "rating": "32",
        "description": null
    },
    "Artificial": {
        "rating": "32.5",
        "description": "Artificial is a difficulty entirely made by AI. including this page.\nThis difficulty is designed to bring out the absolute best in you. Only the most skilled players will be able to overcome this challenge, but if you're up for the task then there's no better way to test your abilities. Be prepared for some extremely difficult enemies, challenging puzzles, and environmental hazards. Stay focused and don't let any setbacks discourage you; if nothing else, this difficulty will offer you a chance to learn and adapt. It won't be easy, but if you can overcome this challenge then nothing will be beyond your reach!"
    },
    "Hellicious": {
        "rating": "33",
        "description": " Hellicious is a Humanly Impossible difficulty which succeeds Does Not Compute but preceeds Invigorating, to put it simply. It was difficulty 100, so congrats on getting here! Even though when Class -2 made it no longer 100. \nIt is the last Baseline Class 5 difficulty. Not only that, but it's very punishing taking it into obstacles, and there will be incredibly unforgiving obstacles that no average person can and will do. This difficulty usually has towers that are very punishing, and the boss only reinforces that. \nYou'll be needing an extra-long break after this one. By the way, though, Niflheim is just the Norse \"snowy hell\", so this difficulty has snow in it, and the floor is colored a shade of red. That's really all though, so lets get to the icon!"
    },
    "Invigorating": {
        "rating": "34",
        "description": null
    },
    "Apocalyptic": {
        "rating": "35",
        "description": null
    },
    "Eternal Outrage": {
        "rating": "35.5",
        "description": " Eternal Outrage is an unofficial Class 5 sub difficulty that squeezes into the gap of the Apocalyptical Apocalyptic, as well as the Destruction with a >:3 face. \n Eternal Outrage is created for the purpose of granting you permanent anxiety and distress disorders, as well as mainly to do its job, obliterate players. The cat inside this box is not sentient, but its more of an artificial intelligence robot that learns from the player's skill, which if the person who beats this difficulty, its obstacles shift into something new, and trying to find ways to make it harder for the next person to complete. Still, at the same difficulty.\nFortunately, Eternal Outrage's cat does not affect the gameplay, but however, the further you go, the faster the instant kill lava rises. The obstacles itself are kind of alright but most of its difficulty relies on its instant kill lava flood, so you have to be fast if you do not want to get consumes by the flowing lava underneath you.\n Eternal Outrage is just another difficulty after all. You will be able to beat this... right? "
    },
    "Destructive": {
        "rating": "36",
        "description": "Destructive is a Class 5 difficulty. Good news! You've finally gotten a break from wallwalks and killbricks. That seems great, but there's bad news. This difficulty is MUCH harder than Malicious. Your fate has been sealed by multiple mid-air corner clips, and other various unknown glitches. One wrong frame-perfect jump, and you can either get flung or thrown onto the bottom instant killbrick! Many towers of this difficulty will always have mid-air corner clips. (97% GUARANTEED) Now good luck getting through this, because you're going to need a lot of skill and a ton of luck on your side.\nThis difficulty is weird, indeed, because it does not follow Class 5 standard. Destructive is harder than it's neighboring difficulty, Apocalyptic, though easier than Dissonant. Also, this is the last difficulty before killbrick-spam gets out of control.. If you want to see harder difficulties, get ready for absolute P A I N."
    },
    "Dissonant": {
        "rating": "37",
        "description": null
    },
    "Mischievous": {
        "rating": "38",
        "description": " Mischievous is a mid class 5 difficulty located inbetween Dissonant and ᴇʟᴅʀɪᴛᴄʜ. This difficulty is located in the extreme limit of physically possible and physically impossible. The difficulty is borderline humanly impossible and would take years to verify a single obstacle from this difficulty. Even with Tool Assisted Superplay (TAS) and macros it would take hours. Lag spikes can make Mischievous difficulty obstacles impossible at this point. It is almost beyond pixel and frame perfect.\nDoing a tower of this difficulty seems crazy. Everything is luck based and because of that, not even skill will be enough. To be able to beat a tower with Mischievous difficulty, you'll need to use macros and FPS unlocker. But it's still not legit, so... Good luck.\nOverall, only robots and AIs would be humanly able to do any towers with this difficulty, if it's programmed correctly it could even do things harder."
    },
    "ᴇʟᴅʀɪᴛᴄʜ": {
        "rating": "39",
        "description": "ᴇʟᴅʀɪᴛᴄʜ is a difficulty before Monstrous, but succeeding the difficulty Mischievous. To beat this difficulty you must need skills that no human has. You also must complete insanely difficult jumps, and tight areas that you must climb out of. The difficulty is designed to be difficult and hard to follow, as sometimes the confusing mechanics and unknown paths can make it hard to find the right thing to do. Being the last difficulty in Mid class 5 on the Main Difficulty chart, this difficulty is classic and serves a nostalgic service in the chart. "
    },
    "Monstrous": {
        "rating": "40",
        "description": " Monstrous is a Class 5 difficulty that succeeds Malicious. It is the fourth hardest difficulty of the Universal Difficulty Chart. \n Monstrous simply represents difficulty beyond the limit of Malicious, anything labeled as \"Beyond Malicious\" would generally fall under Monstrous. If Chaotic Tower were to be the limit of Malicious, then this would be seen as any tower that is an extension or relatively normal buff of Chaotic Tower. \nIcon Representation\n Monstrous's icon is quite simple. First, it has one of the Greek letters in the center of the icon, highlighted in red and said letter is named Zeta or 'ζ'. The background is a simple gradient, black fading into red. It's really just a normal icon with a symbol on it. Ol' jazz."
    },
    "Inimical": {
        "rating": "40.33",
        "description": null
    },
    "Horrendous": {
        "rating": "40.66",
        "description": null
    },
    "Ultimate": {
        "rating": "41",
        "description": " Ultimate is a Class 5 difficulty that succeeds Horrendous. It is the third hardest difficulty of the Universal Difficulty Chart.\n Ultimate represents the assumed limit of difficulty, meaning it consists of the hardest jumps that we believe to be possible, not that it can ever be officially verified by human or technology. \nAn example of an Ultimate difficulty tower would be, if you took Chaotic Tower and buffed every floor to what you believe to be the hardest possible difficulty, and then extended the tower to some degree.\nIcon Representation\n Ultimate's icon is quite similar to Monstrous’ icon, the backgrounds are of the same gradient: black fading into red. Then there a letter of the Greek alphabet centered in the middle of the icon. The letter is \"Psi\" ψ, highlighted in red. "
    },
    "Nought": {
        "rating": "41.5",
        "description": "Nought is a High Class 5 difficulty, which succeeds the extremely deranged difficulties Ultimate, and yet precedes the even more mentally endangering System Error By now, we are at the stage where physical possibility is almost solely reduced to a concept. Anyway. This difficulty is classified as ‘TAS Impossible’ due to a multitude of factors, such as an inhuman ordeal of luck required, precision and timing leading to mental insanity, and much more.\nEven the greatest of obbyists and tiered-obby masters end up succumbing to this hellish monstrosity, even with the use of external gadgets such as Tool Assisted Speedrun and Bootleg Coil. This is be due to Prodigous luck incapable of the human species required, and pixel perfect precision required. Even just an absolutely nanoscopic mistake can cost you your entire run.\nNot even jumps of this are possible, even when given tremendous patience and reat amasses of effort, and even though this is currently classified as Impossible, enough time and effort amassed by the Human race may prove this difficulty Humanly Possible in the far future. This could take years, or even decades."
    },
    "System Error": {
        "rating": "42",
        "description": " System Error is a Class 5 difficulty that succeeds Ultimate. It is the second hardest difficulty of the True Hardest difficulties section of the Universal Difficulty Chart. \n System Error is beyond the assumed limit of difficulty; meaning it is uncertain if obstacles here are humanly or physically impossible. If Citadel of Void were humanly possible and were of Ultimate difficulty, for it to be System Error, the citadel would need to be buffed to the point where the human possibility of the gameplay itself is uncertain, and be extended further to inhumane lengths.\nIcon Representation\n System Error has a similar color scheme to both Monstrous and Ultimate. \nThe background has a black to red gradient, identical to the two previous difficulties, with less black as it fades into the crimson. The icon contains an unknown symbol colored in bright red, and holds the phrase 'System Error'. The words themselves have a gradient, the first letter of each word are a red tinted with white; the following letters gradually redden. "
    },
    "Error.exe": {
        "rating": "43",
        "description": null
    },
    "Simply Beyond": {
        "rating": "44",
        "description": null
    },
    "Ultra": {
        "rating": "44.5",
        "description": null
    },
    "Critical": {
        "rating": "'''<big>45</big>'''",
        "description": "Critical is a class 5 difficulty sandwiched between Simply Beyond and Winter. Attempting this difficulty is highly unrecommended, as it can be very difficult to even understand obstacles, and it's several orders of magnitude harder to complete such obstacles legitimately.\nObstacles of this difficulty are usually several smaller obstacles pieced together with no room in-between to take a break at, plus several frame perfects at framerates higher than preset framerates offered by standard Roblox FPS unlockers, with no-cap options being your only chance plus a very high-end device. However, with TAS, you could potentially render each frame with a small time increment at a very slowed-down pace, given that your TAS actually has these tools for high framerate gameplay."
    },
    "Winter": {
        "rating": "46",
        "description": null
    },
    "Fatal Error": {
        "rating": "47",
        "description": null
    },
    "U DED SON": {
        "rating": "48",
        "description": " U DED SON is a Class 6 Difficulty that lies before REEE...!!! and after Fatal Error. The main colors for this difficulty are going to be pink, purple, and peach. Acting as the last barrier before the Low spectrum of Class 6, you probably shouldn’t attempt it, considering it’s even beyond TAS and human capabilities.\nOf course, this is impossible, as you'd have to do unimaginable glitches and use confusing and infeasible strategies to beat this. You'd also have to practice for months and even years if you're a lower tier obbyist."
    },
    "REEE... !!!": {
        "rating": "49",
        "description": "REEE... !!! is a difficulty that is located in Class 6, The Road of Pseudo Difficulties. It is also between U DED SON and Nonexistent. Any tower in this difficulty is impossible. Nobody should be here anyways. You probably used noclip so I don't mind, but still, I am warning you. You will get annihilated by this. Your soul will get consumed. You will suffer in pain and agony. There's no point to life for you. So please, just jump into that Instant-Killbrick and die, RIGHT NOW. And besides, the main colors are always going to be blue and white. "
    },
    "Nonexistent": {
        "rating": "50",
        "description": "Nonexistent is a Low Class 6 Difficulty and is in the 2nd last road of pseudo difficulties. Nonexistent is unbearably hard, which is to be expected. Because of this, you need a ton of practice. Before stepping foot in this difficulty, it is expected that you beat a tower of the previous difficulty, REEE... !!!. This will be great practice for Nonexistent and for the future. Also, fun fact, Nonexistent has so many wallhops and gaps that somebody made a nonexistent tower that was completely purist. It is a nearly guaranteed that every difficulty from Nil and above will have killbricks, so making a Class 6 difficulty without any killbricks is impossibly difficult to create. This also means that Nonexistent can be skill based. Sure, there’s a lot of RNG still, but at least you don’t have to rely on God’s luck to win."
    },
    "D-I-E": {
        "rating": "51",
        "description": null
    },
    "Absolutism": {
        "rating": "52",
        "description": " Absolutism is a Mid Class 6 difficulty which is harder than D-I-E, yet easier than Insistent. At this point, going any further is highly ill advised, I don't even know why you are still persisting when this is obviously impossible, and not even humanly impossible at that, there isn't any point to this, so why are you spending decades of your lifespan to impossibly hard difficulties in a Lego game, not even an actual parkour game at that?\nI think it's obvious by now that this will require unfathomable amount of luck that not even luck manipulators can't obtain reliably, and that the skill you will need is through the roof. I recommend you to begin to practice a LOT if you wanna have a chance at this difficulty."
    },
    "Insistent": {
        "rating": "53",
        "description": " Insistent is a Normal difficulty settled in the reaches of Middle Class 6, successing Absolutism and preceding Shocking. It is regarded humanly impossible, rendering any legitimate attempts at an Insistent ranked obby futile. To have even the slimmest likelihood of completing any of the grueling obstacles Insistent obbies have, a player must be prepared with particular tools that can help overcome the hindrances.\n Insistent towers and obbies are made for entertainment purposes, and are not meant to be attempted legitimately."
    },
    "Shocking": {
        "rating": "53.5",
        "description": " Shocking is a Mid Class 6 sub-difficulty, lodged between Insistent and Victor. This difficulty has originated from the ‘JToH’s Joke Towers Revamp Wiki’, and has been brought here due to the wiki being abandoned minutes after being created. Pretty pointless, right? Moving on from that. \nThis difficulty possesses gruelling obstacles that no lifeform could dream of even passing, and boost items like Gravity Coil and a TAS so complex, very few humans currently comprehend must be used if you even want to get past the first obstacle. As such, representations of this difficulty are often undermined by issues like inaccuracies and repetitive, unfun gameplay, due to play testing being a dubious, near-physically impossible task, and original, fun mechanics being practically impossible to make at this stage of obby-building. \nThis difficulty is also notorious for its tendency to randomly instakill the player for seemingly no reason at a 1% chance every minute, and towers of that difficulty are about 30 minutes long. "
    },
    "Victor": {
        "rating": "54",
        "description": "Victor is a Class 6 difficulty, settled within the Middle range of it. This difficulty lies between Insistent and QUANTUM, or Shocking and Oblivion when counting sub-difficulties. This gives it a rating of 54. \nThis difficulty is regarded as utterly humanly impossible, meaning there is no chance whatsoever of an attempt of an obby categorised under Victor going well. They also tend to be made not as actual, fair obbies, but rather more as entertainment due to their factual impracticality."
    },
    "Oblivion": {
        "rating": "54.5",
        "description": null
    },
    "QUANTUM": {
        "rating": "55",
        "description": "Quantum is the difficulty after Oblivion but before Miracle, and is slightly harder than Oblivion. Quantum can be considered \"\"\"the absolute border for macros\"\"\" to beat. \nYou will need an absolute perfect macro created in a Quantum Computer, then create 500 copies of those macros/bots, make it play a Quantum Difficulty tower then make it learn all the obstacles, whenever one macro learns an obstacle it passes its information to the rest, even with all of that it will take a few weeks or even months for the macro to manage to beat this.\nOtherwise you can always buy a macro/TAS from Lord Obama."
    },
    "": {
        "rating": "56",
        "description": null
    },
    "Y E E T U S": {
        "rating": "56.5",
        "description": " Y E E T U S is a Class 6 Sub-Difficulty at a high range and a Humanly Impossible type. This difficulty is inbetween Miracle (56) and DELETE (57), with rating of 56.5 and a sub-difficulty of Miracle. This difficulty is probably one of the oldest difficulties on the wiki, with the first appearance from YEETUS on this wiki is the earliest version of the Difficulty Chart (exactly 1 July 2020), but the date was created outside the wiki, at around the 1st of March, 2020 at Yeetbox. "
    },
    "DELETE": {
        "rating": "57",
        "description": " DELETE is a Class 6 difficulty which is right after Miracle in most Towers/Great Citadels it is included in. This difficulty will straight up delete you, and there’s no way to stop that. Getting hit by a laser is an instant ban and death. The floor is also ran by a corrupted robot which is impossible to destroy. This robot will be sure to throw obstacles that will surely mean your demise. If you will proceed and get deleted, all I can say is that you’ll never return."
    },
    "Interruption": {
        "rating": "57.5",
        "description": "Interruption is a sub-difficulty that has humanly impossible obstacles. This difficulty is basically harder than DELETE and currently easier than Xi-Alpha (previously Unstable and Derpy (Sub-Sub-Difficulty)). So, you're probably not going to be completing this difficulty anytime soon. \nYou would immediately fail once you jump. When you are trying to be attempt any obstacles in this difficulty, you would get distracted and get interripted. Why would you even do this? There isn't such a way one or multiple humans would beat this. You cannot avoid anything in this difficulty and it is completely annoying. "
    },
    "Xi-Alpha": {
        "rating": "58",
        "description": " Xi-Alpha is a difficulty after DELETE, yet before Theta-Void. It is located in Peak Class 6 and is the first the first difficulty of MrXY201’s Difficulty Chart. It has three sub difficulties, which they are Gar-Terrifying (Gar Chain), D-E-L-T-A and Ÿ. It also used to have 2 sub difficulties, Xi-Beta and Xi-Delta, both of which are gone due to being low quality.\nIt should not be attempted due to it requiring you to somehow surpass it without the use of TAS, unless you use noclip or even exploits. The tier system is also ineffective at this difficulty, due to it going way out of reach of the system, and the Kol Metris value is high, at around |55| (estimation). \nYou should also attempt towers like the old Obelisk of Symbols Difficulty Chart (back when the difficulty was Everdark) before beating this monstrosity (despite you obviously not being able to). That is all there is to something like this."
    },
    "D-E-L-T-A": {
        "rating": "58.33",
        "description": null
    },
    "Ÿ": {
        "rating": "58.66",
        "description": " ÿ is a Class 6 sub-difficultÿ and the third difficultÿ of Mike's Difficultÿ Chart, out of 5. Preceding it is the second difficultÿ of the chain, D-E-L-T-A. After that lies Theta-Void, the penultimate difficultÿ of the chain. ÿ is so difficult, it is impossible to complete with naturallÿ, even with a TAS. The onlÿ waÿ to trulÿ complete something of this nature is to abuse phÿsics in waÿs that nobodÿ has ever done, or use something like noclip or a coil.\n ÿ's name originates from the ÿ found in Dutch and Afrikaans. This follows the pattern of different sÿmbols being used in the difficulties in the chain, such as Delta being used in D-E-L-T-A and Theta-Void containing a theta (in its old icon).\nThis difficultÿ requires unimaginable luck and skill, even more than required in D-E-L-T-A, and incredible motivation to keep pushing through it. Though this difficultÿ does surpass D-E-L-T-A in difficultÿ and luck, there are still difficulties that require more to beat, such as Theta-Void.\nThe difficultÿ in tiers would be around 58.66, due to there not being anÿ defined tiers around this difficultÿ and the nature of tiers being quite confusing. It would also land a Kol Metris rating of |587|+ due to its placement.\nAlso, a special \"gimmick\" of this difficultÿ is that everÿ Y (I'm giving that specific ÿ a pass.) must be replaced with the ÿ sÿmbol in anÿthing related to it."
    },
    "Theta-Void": {
        "rating": "59",
        "description": " Theta-Void is a Class 6 difficulty and also is the penultimate difficulty of Mike's difficulty chart, preceding Ultimaniac. It also lies after another difficulty in Mike's difficulty chart, ÿ. It is TAS impossible, meaning that Theta-Void is impossible even with a TAS.\n Theta-Void's name originates from the theta symbol from the Greek alphabet (Θ) and the word \"Void\". This signifies the fact that this difficulty is quite impossible, like the endless void\nIf one tried to beat a difficulty of this magnitude, it would require immense skill that no obbyist has and an incredible amount of luck. However, difficulties succeeding this difficulty would require even more skill and even more luck, such as Ultimaniac.\nThe difficulty in tiers would be around 59, due to there not being any defined tiers around this difficulty and the nature of tiers being quite confusing. It would also land a Kol Metris rating of |592+| due to its placement."
    },
    "Ultimaniac": {
        "rating": "59.5",
        "description": null
    },
    "Supreme": {
        "rating": "'''<big>60</big>'''",
        "description": " Supreme is a difficulty located in Class 6 (Class 9 in the Community Difficulty Chart) of Legendary status with the rating of 60 (or 79 in the CDC). Supreme succeeds Ultimaniac—the last difficulty of Peak Class 6, and precedes Phi—Supreme's first Sub-Difficulty. The same is for the Community Difficulty Chart, only with Supreme being located in Middle Class 9. It was the first legendary difficulty to be created, and the fourth legendary in terms of order on the difficulty chart. It is generally used as the last difficulty in a lot of difficulty chart towers because of its high status and importance to the difficulty chart.\n Supreme represents the limit of difficulty - the unknown limit, as there is no telling as to what the true limit of Roblox difficulty is, especially in the constantly ever-changing realm of Roblox physics and Tool Assisted Speedrun mechanics. There cannot be a Low-Mid-High range within Supreme. There can only be \"Supreme\" as it is the true, supreme limit to possible difficulty. The slightest buff will make this physically impossible.\nFurther Description\nHowever, we face an issue with this definition. Given a tower of ten floors is placed within Supreme; the tower can be extended – a tower of eleven floors of Supreme difficulty. This is a buff; the new tower is intrinsically harder than the previous. Therefore the ten-floor version was not the limit of difficulty, so it cannot be considered Supreme.\nTo fix this issue, Supreme can be fully defined as \"the limit of difficulty within a domain\". Meaning, building the hardest possible obstacles within the given area. If you are building a Supreme tower, then any buff to a single obstacle within the tower would render it impossible.\nAny difficulties beyond are this are physically impossible. Obstacles of this difficulty must balance on the fine line of being the absolute most difficult while still being non-physically impossible. It is tough to keep such balance, meaning most portrayals of this difficulty are inaccurate.\nIcon Representation\nThe borderless icon is a linear gradient from pink (bottom) to blue (top). Due to this, the colors blend together and create some purple in the middle, with there being less pink than blue. \nThe new icon is also a linear gradient; but with a thick border that follows the same pink-to-blue gradient as the background, the border however is brighter and more saturated, in contrast to the darker, nearly-black gradient center. Other than that, It's fairly simple, and anyone can recognize the icon. "
    },
    "Phi": {
        "rating": "60.33",
        "description": null
    },
    "UNTHINKABLE": {
        "rating": "60.66",
        "description": null
    },
    "Ultra Instinct": {
        "rating": "61",
        "description": "Ultra Instinct is a Baseline Class 7 difficulty made by Octogoat YT and later revamped by TasmanianRex. It is between the Supreme or UNTHINKABLE and Mortifying difficulties, and its position was changed many times since the creation date. This difficulty used to have a sub difficulty named Super Saiyan, but it was deleted due to rising standards of this wiki.\nObstacles on this difficulty requires the player to perform unknown glitches, pixel perfect jumps that require TAS to perform, and requires time and effort to attempt this difficulty. Comparing this to Supreme or UNTHINKABLE, this difficulty is thrice as challenging in terms of obstacles and glitches.\nYou should attempt The Final Universe before this difficulty, but you need to practice hard. The challenge is that there is a lack of Towers besides Difficulty Chart Towers, which they can take a while to complete. You should try to attempt the previous Tower depending on the difficulty."
    },
    "Mortifying": {
        "rating": "62",
        "description": null
    },
    "Dreadful.exe": {
        "rating": "62.5",
        "description": "What is Dreadful.exe, you may ask? Dreadful.exe is in class 7, preceding Transfinite, but placed after Mortifying. This difficulty is an \".exe\" difficulty, which means it is an application that can modify your computer, or your screen.\nTowers in this difficulty are not only difficult, but have unfair catches such as covering your screen with \">:D\" signs. Due to this, obstacles are difficult and belong in class 7, as well as being incredibly unforgiving, often causing you to lose all your progress by even failing one jump.\nIf one would actually attempt a tower in this difficulty, they would need to practice doing obstacles blindfolded and with other unfair catches, as well as practicing the obstacles normally, and possibly even practicing some of the obstacles in real life. To complete a tower in this difficulty would be incredibly difficult and would be a renowned achievemnt for any obbyist. In fact, completing any obstacle in this difficulty would be an achievement that no obbyist has ever achieved."
    },
    "Transfinite": {
        "rating": "63",
        "description": " Transfinite speaks itself by the incomprehensible way possible throughout for the previous difficulties. This difficulty is currently placed in the Baseline Class 7, the beginning of a new obstacle ahead. This is between Dreadful.exe and progressing further more on RoorXD. Towers or Citadels within' this difficulty should be physically impossible, every obstacle in this difficulty are highly buffed, if we suppose we're on Ultra Instinct, its far away being harder than this difficulty itself. Obstacles being in this difficulty are rarely spotted and cannot be beaten since they're mostly Impossible.\nIf you must know, its rating in Kol Metris would be around |550| and it is currently ranked 63 at the Extended Difficulty Chart."
    },
    "RoorXD": {
        "rating": "64",
        "description": null
    },
    "RoorHELL": {
        "rating": "64.5",
        "description": null
    },
    "Jesus Ballin'": {
        "rating": "65",
        "description": " Jesus Ballin is one of the hardest known difficulties imaginable, Jesus is ballin'. Who would dare to confront him into a challenge? Jesus Ballin' is a Low Class 7 Difficulty between RoorHELL and El Vacio, and also has two sub-difficulties, HyperViolent and Enclosed. The icon on the background is represented by a light-ish green color similar to Easy. Though easily huh? Comparable to a greener Terrifying with a transparent picture of Jesus playing with a Basketball because, Yes. As of now, there's not much known about this difficulty since it's pretty mysterious... The difficulty's image USED to have a different Jesus but more visible. However, it has been changed for unknown reasons (Unspecified Reasons). Jesus will be ballin' until you finish his Difficulty, He won't stop, He will never stop! (he do be ballin) \nJesus Ballin will consist of TAS being Impossible, Y'know jumps are almost impossible at this point, right? It could be possible but with a very highly chance to beat it, well this is now the time the Judge will Judge YOU if you are trustworthy managing to pass through him while he's ballin!"
    },
    "HyperViolent": {
        "rating": "65.33",
        "description": " HyperViolent is a Low Class 7 sub-difficulty between Jesus Ballin and El Vacio. This is not for your average obbyist, as this difficulty is quite a step up from Jesus Ballin. This difficulty is Physically Impossible and should not be attempted without care. \n HyperViolent includes jumps that the Roblox physics engine does not intend any player to accomplish without the help of exploits, boosts, or any other type of advantages, and due to that is Physically Impossible. Not only that, but it is incredibly punishing, meaning that if you fail at any jump, you probably will lose a lot of progress. \nCompleting any jump of this difficulty is an incredible accomplishment, that no obbyist has ever done. However, this difficulty is not the end of the difficulty chart, as it is nothing compared to future difficulties such as MegaDeath. From Class 7, the step between difficulties will be increasingly bigger, reaching exponentially and tetrationally.\nTo beat a tower of this difficulty, you would need incredible skill and luck, as difficulties past this point require massive amounts of luck. You wouldn't be able to even complete obstacles in HyperViolent difficulty with TAS, much less legitimately without any sort of items or unfair glitches that would allow you to skip the entire tower. To complete a tower in this difficulty, it would be recommended to use items like a Blessed Coil, or just straightup use noclip to just skip the entirety of the difficulty. "
    },
    "Enclosed": {
        "rating": "65.66",
        "description": null
    },
    "El Vacio": {
        "rating": "66",
        "description": " El Vacio is the spanish for THE VOID. The original icon resembles an SMG4 poorly edited picture that was made creepier. (It was originally going to be black with SCP-087 face and XD on it, which I think is more nightmare fuel.) As for the current icon, it is not as creepy as RoorHELL, D-I-E or Nonexistent. Obbies with this difficulty should be miles harder than Jesus Ballin' and It should be ultimately impossible. seriously, do not even think about beating this difficulty. Every obstacles in this difficulty are very rarely to be seen and very hard to be manuevered. As for now, this difficulty is buffed and it's a lot harder than Jesus Ballin, maybe universe disruption or even Aleph-cow and very rarely Megadeath depends on how do you design your obstacle. Attempting an obstacle of this difficulty will cause imminent death. The Decal id of the difficulty is: 7281337903."
    },
    "Universe Disruption": {
        "rating": "67",
        "description": "Oh no, what did you do? You overloaded the universe WAY too much, and now there’s a massive malfunction with the system! You need to fix it by traversing through impossible obstacles to overload the system until it activates it’s natural safeguard and returns to safe levels.\nUniverse Disruption is a Class 7 difficulty, and is the first of 3 challenges to prepare you to face the terminus of the official chart, MegaDeath. It is located after El Vacio and before Illegal (or Complete: Obstacles as sub-difficulty). The difficulty is unfeasible even while using TAS and boost items, meaning stuff like exploits is a must to have an opportunity at moving forward."
    },
    " Obstacles": {
        "rating": "67.5",
        "description": null
    },
    "Illegal": {
        "rating": "68",
        "description": " Illegal is a high Class 7 difficulty. It is one of the first Class 7's on the difficulty chart. What can I say except this is impossibly hard? This difficulty features physically impossible jumps. For example, a 125 stud jump or a 60x120 stud stick out. Not even doing a hundred of 45 studs in a row is enough for this difficulty. You cannot complete most of these jumps in Illegal even with TAS (pretty obvious if you've seen the difficulties in the wiki).\nObstacles in Illegal are usually mega buffed jumps of Class 2 or 3 difficulties, but most of them are extremely obscure and will most likely require exploits to carry out. Unlike other difficulties before and after this, doing a jump in this difficulty is quite simple, all you need is to use exploits.. or use some obscure, never-before-seen glitch that either makes you go extremely long distances or survive instakill bricks. But that's just for a small type of jumps featured in this difficulty. Some puzzles might require you to complete the whole of JToH 50 times (Low-Mid), or delete a part via glitching to progress (Very-High)."
    },
    "Bad Request": {
        "rating": "68.5",
        "description": null
    },
    "Universal Glitch": {
        "rating": "69",
        "description": null
    },
    "FalseGanar": {
        "rating": "70",
        "description": " FalseGanar is a High Class 7 difficulty that is between Universal Glitch and Hopeless. This difficulty was made by OqYTRXD on 5/14/2022. FalseGanar has a very confusing name. The meaning of the name is that \"false\" means \"fake\" in English, and \"ganar\" means \"win\" in Spanish, so the full meaning of the name is \"Fake Win\". It represents how hard and ridiculous the difficulty is. The obstacles are terrifying, tight and accurate, and you need huge amounts of luck to able to complete them. This difficulty is harder than 10,000 floors of Death and RoorXD combined, so passing through this difficulty's obstacles consists of many years of practice. "
    },
    "Hopeless": {
        "rating": "71",
        "description": " Hopeless is one of the Class 7 difficulties that's placed between the difficulty that could glitch the entire universe which is Universal Glitch, and the one hell of a finale which is the second legendary difficulty MegaDeath. Judging by the placement itself, you could clearly see that it's ridiculously impossible, or even beyond it. At this point, using TAS isn't the case here.\n Hopeless difficulty towers will shatter all your hope, as the name suggests. The gameplay will also be very confusing and much more complex than the previous challenges you had faced. By beating this absolute monstrosity, you'll have to preform beyond precise movements and perfect timings, so mastering a jump wouldn't be an easy task. Beating a tower of this difficulty is extremely hard, even if using things such as extreme TAS abuse.\nThis would be Tier ~2,500 if ranked using tiers. Due to how inaccurate tiers can be, we would have to rank using the Kol Metris rating system, and it would have a value of |~1500| if doing so."
    },
    "Plum Bloc": {
        "rating": "72",
        "description": null
    },
    "Gameifying": {
        "rating": "72.5",
        "description": null
    },
    "Infinity": {
        "rating": "73",
        "description": null
    },
    "Void": {
        "rating": "73.5",
        "description": "Void is a Devilish Difficulty incorporated in Peak Class 7, placed-inbetween Infinity & its successor Doog. This difficulty is physically-impossible or basically just impossible in simpler terms.\nObstacles of this difficulty are highly complex & janky. However, it is completely pitch-black in your screen, hence it's name Void. Which means the difficulty requires inhuman and rough memorization aswell. It is speculated that it is TAS-Impossible."
    },
    "Doog": {
        "rating": "74",
        "description": null
    },
    "Dissension": {
        "rating": "74.5",
        "description": " Dissension is the former last difficulty of the official chart, before MegaDeath swooped the throne from it out of choice from the creator. Speaking of which, this difficulty is located between Doog and MegaDeath, the finale of the official chart, but not here. In the Unofficial Difficulty Chart, it is far from the last difficulty. This doesn’t change the fact that it is still absolutely, Inexistently, beyond any form of possibility. To put it bluntly, you’ll probably be stopped. I know it’s repetitive, but it’s how things are.\nThis extends far out of the tier list, although the tier amount of Dissension could be closer to the high thousands and low tens of thousands, and the Kol Metris value may be close to the middle-high hundreds or even the highest hundreds. Yeah, it’s very hard."
    },
    "TooPrecise": {
        "rating": "75.5",
        "description": null
    },
    "Epitome": {
        "rating": "76",
        "description": null
    },
    "Agony": {
        "rating": "77",
        "description": " Agony is the first difficulty in the Mischievious Class 8, and was deleted for author request due to the owner, The Difficulty Enthusiast, not having much motivation during its creation. However, when the creator regained motivation, it was revived by the author. It is located directly surpassing Epitome and is located directly preceding the livid Abyssal. Agony necessitates physically impossible obstacles, breaking logic of Roblox obbying, due to how high up in the difficulty chart this is located in. \nEven just accomplishing a singular jump of this difficulty is a feat in gaming that will never be surpassed, due to the fact that the jumps are so mind-bogglingly impossible, they are unbeatable. There are decoys and traps hidden with the rest of the gameplay, which are impossible to detect on your first run, meaning there are no ‘first-try’ completions of Agony, and there never will be. \nFurthermore, not even the most precise TAS there is could help you, so you must dive into sketchy exploits, and overpowered items only for important people in the community, like JToH’s Blessed Coil, in order to even have a nanoscopic chance of surpassing Agony. "
    },
    "ILOVEYOU": {
        "rating": "77.5",
        "description": "ILOVEYOU is a baseline Class 8, ranked 77.5, is in-between other main difficulties, Agony and Abyssal. Created on April 18, 2023 by Bryan, ILOVEYOU has no sub-difficulties, decal, or music. Lastly, ILOVEYOU isn't in any chains, hasn't been revived, revamped, or removed.\nILOVEYOU is classified as a physically impossible difficulty, which means it is impossible to do even with TAS, you must defy roblox physics in order to win. It is near the middle of the physically impossible range.. So good luck with that.\nThe ILOVEYOU virus comes in an email with \"ILOVEYOU\" in the subject line and contains an attachment that, when opened, results in the message being re-sent to everyone in the recipient's Microsoft Outlook address book. This virus alone costed US$5.5–8.7 billion in damages worldwide, and estimated to cost US$10–15 billion to remove the worm. Within ten days, over fifty million infections had been reported, and it is estimated that 10% of Internet-connected computers in the world had been affected.\nThere is many gimmicks, but more of them are practically catches then anything, such as screen being covered, ads everywhere.\nMoving onto icon representation.."
    },
    "Abyssal": {
        "rating": "78",
        "description": "Abyssal is the third Class 8 difficulty and the final regular difficulty. This is the final barrier before Reality and Virtual Reality difficulties collide. This is the final infinity before everything starts over. This difficulty requires insane tricks and glitches to be able to pass.\nBut this is not the end. Even though this is already extremely hard, the next difficulties are going to be even harder. There are no more regular obstacles after this. Only virtually & obviously impossible ones.\nThis difficulty has a barrier of obstacles so impossible that MegaDeath is Win compared to this difficulty of true impossibility. "
    },
    "Dilly Impossible": {
        "rating": "79",
        "description": " Dilly Impossible (D.I.) is a Class 8 Fabled Difficulty (or Former Legendary Difficulty) located on Low range. D.I. is a Physically Impossible difficulty, meaning this is completely impossible for humans and TASes to complete it, unless you use abusing physics or using exploits. D.I. appears multiple projects such as GCoHD, MoDDA and a lot more, speaking of Towers. D.I. is originated at Great Citadel of Custom, Impossible and Normal Difficulties original version, all away to 2020 and it was made by Astrominal (Originally known as Astrominal). Accoring to Astrominal, D.I. was meant 500 times harder that MegaDeath. If D.I was 500 times harder, the obstacles meant to be thousands studs, approximately Peak Class 8 to Baseline Class 9.\n Dilly Impossible is in-between Abyssal (78) and Unreasonable (80), alternatively Gigaversal (79.5), with rating of 79. D.I has 5 sub-difficulties, which they are; one official, one fictional, two deleted and one scrapped. Gigaversal (79.5), Forgotten (fictional), Unpredictable (deleted), Frost (deleted) and Absolutely Impossible (scrapped)."
    },
    "Gigaversal": {
        "rating": "79.5",
        "description": null
    },
    "Unreasonable": {
        "rating": "80",
        "description": "You have been improving over time, but at what cost? It's not like you must conquer thousands of consequences. The entire solar system has been destroyed, the planet is slowly decaying, and it's all your fault. Give up, you're not capable for these types of stuff. It gets tougher everytime you proceed, but you'll never make it to the end of the chart. You're a fool, thinking you would actually beat this hell of a difficulty chart."
    },
    "Resilient Glow": {
        "rating": "81",
        "description": null
    },
    "Arcane": {
        "rating": "82",
        "description": "So, you did Resilient Glow, now what is this? You're in an area where everything is a wave, you don’t like this, you're in confusion, what have you gotten into? Really, why are you trying to complete the difficulty chart? That’s impossible, to me atleast. The later difficulties are way too hard. You're already experiencing confusion over where you are. How would you complete this? This is absolutely unrealistic to complete. Even if I saw you beat everything up to Resilient Glow, I don't know if you can do this."
    },
    "COMMUNISM": {
        "rating": "83",
        "description": " COMMUNISM is a Mid Class 8 Difficulty between Arcane and Satan Tartarus Lucifer Void. You will join our forces and turn into a Communist just like us. Very fun... It's a Difficulty based on a combination of: Ludicrous Obstacles, Nonexistent Logic and, Jumps you couldn't even be able to use TAS with it, You though you were smart huh? This isn't for Weak people, This is for those who have those potentials above The Limit, you are on the High Part of this Class, You are not even the Half of the Difficulty Chart, even though this is the absolute antipode of A. But yet, You are making progress comrade, Good luck and have fun while beating through our Force. "
    },
    "Detroit": {
        "rating": "83.5",
        "description": null
    },
    "Sacrificingly Impossible": {
        "rating": "83.75",
        "description": null
    },
    "Satan Tartarus Lucifer Void": {
        "rating": "84",
        "description": "Satan Tartarus Lucifer Void (or STLV for short) is a Class 8 normal difficulty which succeeds COMMUNISM and preceeds QR Code. Satan Tartarus Lucifer Void is comprised of 4 sections; Satan, Tartarus, Lucifer and Void. You'll see them later.\nOf course, the devil's difficulty isn't this low, they are a god after all. This difficulty has been significantly nerfed by the 4 aforementioned hellified creatured so that its easy enough to have you attempt this but be tortured helplessly without end. Even then, you shouldn't be attempting this difficulty nor the many before this one. They are impossible in everyway. So logically you shouldn't reach this point. But even if you are skilled enough to be able to beat some of the last few difficulties, this one will be your end, but why should this one be different? Well, it was the end of Class 11 previously, so your limit should be close."
    },
    "QR Code": {
        "rating": "85",
        "description": "Over the course of history, this difficulty has two variations, Bar Code and Low Quality QR Code. Bar Code is a sequel to this difficulty, originally meant to be an independent difficulty located in Baseline Class 15. LQQRC is a follow up from Bar Code when the Low Budget Chain was relevant. It was deleted due to personal reasons and later archived in a subpage of User:TasmanianRex.\n Bar Code\n Low Quality QR Code"
    },
    "Errorisation": {
        "rating": "86",
        "description": " Errorisation is a High Class 8 difficulty succeeding QR Code but preceding Esoteric. Errorisation is not just hard, but it's also very annoying. The catches are the reason why this difficulty is so annoying. You could take this difficulty as HELLWRATH but easier. Both of these difficulties follow a lot of similarities. Errorisation is capable of accessing files and data on your computer and injecting malware and other viruses. They are meant to interrupt your gameplay, and to annoy you. So it's not just obby skills, but also mechanic and computer skills. Also you're screwed if you play this difficulty on a mobile device, because it'll just make this difficulty like Class 9. "
    },
    "Godlike": {
        "rating": "86.5",
        "description": ""
    },
    "Esoteric": {
        "rating": "87",
        "description": null
    },
    "Complete Users": {
        "rating": "87.5",
        "description": null
    },
    "BobuxDeath": {
        "rating": "88",
        "description": "Not to be confused with Bobux, or Bobux Ultra, both difficulties are now deleted, so there should not be any confusion between the three.\nBobuxDeath is a joke difficulty in the Death Chain. This is also where you will meet a boss, the Bobux Man himself. This difficulty, the article you are currently viewing, has been revamped a whopping ~1.91 years after its first removal date. \nYou will have no chance in BobuxDeath, or any difficulty of higher magnitude. As all forms of TAS, exploits, FPS unlockers or any other third-party mechanic has been neutralized. BobuxDeath is so arduous to complete, that the theoretical completion rate for this difficulty is in the negatives; -1,077%. Jumps are so long, that average tower frames of 100 x 100 x 1,000 stud size cannot contain the jumps, this means that the frame will require accurate scaling to be able to fit jumps of BobuxDeath difficulty, 25,000 x 25,000 x 250,000, per se.\nBobuxDeath does not have a main difficulty or is the main difficulty of anything, has been revived twice (maybe thrice), revamped at least once, and lastly, moved 2 classes upwards. "
    },
    "Aleph-DEATH": {
        "rating": "88.5",
        "description": null
    },
    "Limiting": {
        "rating": "89",
        "description": "Welcome to the 20th last Class 8 difficulty! Before you reassure yourself, another demanding obstacle lies ahead for you to face, Limiting, The Realm of Theoretical Impossibility comes after this. where everything becomes absolutely absurd. This will be quite the enjoyable ride, won’t it? This difficulty comes before The Crystal Core and after BobuxDeath.\nThis difficulty is really hard to complete, as comparing this to the aforementioned BobuxDeath is like comparing something as hard as Decimation to an easy difficulty such as Onerous. I hope you’re prepared, as this difficulty will be your penultimate challenge to test if you are ready for the next class, Class 13.\nHowever, this isnt theoretically impossible yet, so you can use insanely advanced techniques to pass this, however it would be significantly rng if you weren’t experienced in physical impossible gameplay, so it is recommended to atleast be able to beat BobuxDeath in a few days, so that you will be able to consistently do the obstacles of this difficulty so that you can easily beat this difficulty.\nNow, the last part of this introduction will be to discuss about this difficulty, so the tier is about 500 Oc, and the Kol Metris of this is about |1800|."
    },
    "The Crystal Core": {
        "rating": "<big>'''90'''</big>",
        "description": "Loading...\nTCC Lab Status: Normal\nDo you wish to continue?\n or \nSubject input: \nLoading...\nLoading finished.\nYou may now continue."
    },
    "Rush": {
        "rating": "91",
        "description": null
    },
    "Aleph-VSC": {
        "rating": "92",
        "description": " Aleph-VSC is a Class 9 Difficulty. It is way harder than Rush yet still easier than the horrifying difficulty Misery. Aleph-VSC is considered to be a Devillish or Physically Impossible difficulty, meaning no matter what you can not do a a single jump in such a difficulty. Jumps in Aleph-VSC seems to defy logic, having game-breaking bugs and impossibly long distance jumps. This difficulty also has numerous catches, all making it even harder.\n Aleph-VSC has a rating of 92, for reference, Supreme's rating is just 60, and Megadeath's is 75. If you were to attempt to measure the tier of such a difficulty similar to Aleph-VSC, it would likely land in the trillions. (probably 100,00 as The Middleline is 1'000'000th tier)\nIt is impossible to tier such a beast of a difficulty. In Kol Metris, Aleph-VSC would land at around |1900|. Such hard difficulties as Aleph-VSC require game-breaking bugs and indescribably long jumps."
    },
    "Misery": {
        "rating": "93",
        "description": null
    },
    "Mysterious": {
        "rating": "94",
        "description": "Mysterious is the first difficulty of the Liminality Chain, with the other 2 in the chain being called Undocumented and Denial. As the name would suggest, this difficulty is the embodiment of mystery, and is similar to other difficulties like Choice and Confusion.\nIt also goes between Misery and Undocumented currently, due to the rest of the chain not having been created yet. This difficulty also originated from The Difficulty Machine: Revamp, all the way in Class 33. You can still find it there.\nDespite obstacles not being definitive due to this difficulty's properties, a tier rating of this would be estimated at around the thousands (albeit probably quite inaccurate due to tiers being highly different to difficulties) and the Kol Metris rating would be around |300|."
    },
    "Undocumented": {
        "rating": "95",
        "description": "Undocumented is the second difficulty of the Liminality Chain, with the other 2 in the chain being called Mysterious and Denial. Speaking of which, it goes between those other difficulties in the chain.\nThis difficulty revolves around extremely difficult obstacles, which are very difficult to construct in a tower, let alone complete. You would need tools like exploits in order to even stand a chance against Undocumented.\nThis would have a very high tier rating (around tier 3000?) as well as a high Kol Metris rating (maybe |530|?), although neither of those measurements are precise in this format."
    },
    "Denial": {
        "rating": "96",
        "description": "Denial is the final difficulty of the Liminality Chain, with the other 2 in the chain being called Mysterious and Undocumented. As the name suggests, you are denied from beating this difficulty. It’s that simple.\nIt also goes between Undocumented and Aleph-Something currently, due to the fact that The Middleline was moved. Denial also originated from The Difficulty Machine: Revamp, all the way in Class 36. However, TDM:R has not gotten to class 36, albeit it was approved.\nA tier rating for this would be at around 10,000, exponentially harder than the actual limit for tiers, and Kol Metris would be closer to |1500|."
    },
    "Aleph-Something": {
        "rating": "97",
        "description": null
    },
    "Omniscient": {
        "rating": "98",
        "description": null
    },
    "Enigmatic": {
        "rating": "99",
        "description": " Enigmatic is a normal difficulty which was transferred from the JCC Wiki to the JJT Wiki. Unlike the original, which is in Low Rank 3, this difficulty is the entry point of Class 14, being in the Baseline spectrum of the class. However, it used to be in Peripheral Class 15. \nIt is currently a successor to Omniscient, and a predecessor to Vrery hawrfd rdifficutl!!. During its time in the End of the Official Chart, it was a predecessor of the difficulty-ized 52! phenomenon, known as 52!, and was a successor to True Obama Prism. Also, during its time in Class 14 it was a successor to The Middleline, and a predecessor to Peril.\nThe ludicrous sizes of these obstacles nullify all uses of boost items, even blessed coil. You will never be able to beat this difficulty, or create towers in this difficulty, due to how high up this difficulty is."
    },
    "Vrery hawrfd rdifficutl!!": {
        "rating": "100",
        "description": "HOW u get hehere!!!!111 I will kile yousdanafh!!! I WInt let youf pass this fdififcluty anf go toj fe-smiy.d!21!!121\ndei!!1121212121212 TWHi s iSK yoUR lAST hncCHANFfce11!!111 LEbaebv Ror DIre1q!!"
    },
    "Free-smiley.de": {
        "rating": "101",
        "description": null
    },
    "HELLWRATH": {
        "rating": "102",
        "description": " HELLWRATH is a Class 9 difficulty, coming after Free-smiley.de, and before LOOP. It also has a sub-difficulty called Hellacious. It uses similar logic to Errorisation, but it's way harder than it. It requires godlike obby skill, exploiting skill, and mechanical skill, but even with those abilities, you'll never get close to beating even the easiest obstacles of this, because as you heard already - it's a Class 9 difficulty. It's simply way too hard to beat due to it's obstacles and what the difficulty does itself. \nThe winpad is invisible, CanCollide false, and is only 0.05x0.05x0.05 studs in size, and the position cannot be found with scripts, as it will ban you. The position of the winpad is randomized aswell, and can be from 1k studs to 10m studs away from the spawn. You should've stayed in the lower classes, but now you will see your fate. "
    },
    "Hellacious": {
        "rating": "102.5",
        "description": null
    },
    "LOOP": {
        "rating": "103",
        "description": "LOOP is a difficulty that can be considered the most lengthy on the entire difficulty chart. Let me explain. There is a huge, actually, monolithic tower cross to every other Tower, Steeple, NEAT, Citadel, Obelisk, Great Citadel, Great Obelisk, and even Tower Rush are literally much easier than itself and in existence. (This does not contain any fictional towers whatsoever.) This means gameplay in this difficulty can be hundreds of hours long. The total difficulty for all of these towers and tower types combined into one makes it a Class 9 difficulty. But wait, if all towers combined made this into a Class 9 difficulty, does that mean we can combine more Class 9 towers into this difficulty to make a class 15 one? "
    },
    "Bryanjr4474": {
        "rating": "104",
        "description": null
    },
    "Eɼɼosion": {
        "rating": "'''<big>105</big>'''",
        "description": null
    },
    "Confusion": {
        "rating": "105.x",
        "description": null
    },
    "Dynamix": {
        "rating": "106",
        "description": null
    },
    "Eshinion": {
        "rating": "107",
        "description": null
    },
    "Caught": {
        "rating": "107.5",
        "description": null
    },
    "Catch": {
        "rating": "109",
        "description": "Catch is a Class 10 Difficulty, in between this is absolutely normal difficulty TooAbnormal, and the elite exploiters difficulty Exploitist Elite. It was made by NathanJTOH on November 4th, 2022. It can be classified as a humanly, physically, and TAS impossible difficulty, so prepare yourself.\nBut wait...\nIt has just a few catches that makes this as hard as it is. You see, the obstacles themselves aren't that hard (at least for a Class 10 obbyist like you), but the catches will make it hundreds of times more difficult. For example, one of the obstacles could be a 13 stud wrap. Easy, right? However, a catch could be \"You have eternal blindness\", which is why this is a Class 10 difficulty."
    },
    "IMPOSSIBLE.EXE": {
        "rating": "109.5",
        "description": null
    },
    "Exploitist Elite": {
        "rating": "110",
        "description": null
    },
    "TooTooHard": {
        "rating": "111",
        "description": null
    },
    "EpicTheGamer2014": {
        "rating": "111.5",
        "description": null
    },
    "Zany": {
        "rating": "112",
        "description": null
    },
    "Oh Noez!": {
        "rating": "113",
        "description": "LowMidHigh\nLow\nComplete Glitch Core, but with 1 quintillion ads blocking your screen at all times! How fun!\n5 Quintillion stud jump (Climbable).\n4.8 Quintillion stud jump (Unclimbable)\n4.7 Quintillion stud wraparound (Climbable)\n4.5 Quintillion stud wraparound (Unclimbable)\nComplete 52!, but 100,000 ads are blocking your screen!\nMid\nComplete Glitch Core, but with 1.1 quintillion ads blocking your screen at all times! How fun!\n5.25 Quintillion stud jump (Climbable).\n5.05 Quintillion stud jump (Unclimbable)\n4.95 Quintillion stud wraparound (Climbable)\n4.75 Quintillion stud wraparound (Unclimbable)\nComplete 52!, but 150,000 ads are blocking your screen!\nComplete the first difficulty in this Oh Noez chain, but there’s an advert every nanosecond!\nHigh\nComplete Glitch Core, but with 1.2 quintillion ads blocking your screen at all times! How fun!\n5.5 Quintillion stud jump (Climbable).\n5.3 Quintillion stud jump (Unclimbable)\n5.2 Quintillion stud wraparound (Climbable)\n5 Quintillion stud wraparound (Unclimbable)\nComplete 52!, but 200,000 ads are blocking your screen!"
    },
    "Viratical": {
        "rating": "114",
        "description": " Viratical is a devilish difficulty, and is the penultimate difficulty of The End of the Official Chart (C10). It is in High Class 10, and is located succeeding Oh Noez!, and preceding Pinnacle. You may be on the last difficulty before you face the End of The Main Chart, but that doesn’t mean it’ll be easy. This difficulty stretches the ultimate border between fiction and non-fiction, completely nullifying any type of TAS, or hacks, and your roblox character will be decimated by a spinner at the speed of sound, before you even realize.\nOverall, you most likely will never end up beating this, as there’s a limit of capabilities in everything."
    },
    "Pinnacle": {
        "rating": "<big><big>'''115'''</big></big>",
        "description": "Pinnacle’s icon is represented by a yellow to dark yellow gradient, with three white exclamation marks, with a grey border around them. There are 2 DX and XD emoticons, a :) emoticon, a >:( emoticon, a ??. emoticon, a :] emoticon, a .-. and ._. emoticon and all of those emoticons are located around the exclamation marks, at 0.5 transparency and with various rotations. This icon is recycled from The Middleline, being its old icon."
    },
    "Missing": {
        "rating": "?",
        "description": "Missing is an unknown difficulty. This difficulty, is missing on the chart. It has zero placement, or place. This cannot be defined, in any circumstance. It does not make sense, since The Middleline is the set in stone, end. This isnt the beginning OR end of anything. Its nowhere. \nHowever, this cant be unclassified since it has obstacles that are the SAME difficulty dependent on its point between these 2 difficulties. This wouldn't happen without The Aleph Sequence (baseline Class 11, ranging from Supreme-Null to Aleph) which Missing is not a part of.\nYou may be scratching your head, questioning: “just use the main chart, wacko.” Well, that's the big picture. Looking behind it, you see that this was designed to be EASIER than the main chart. we cant do this. So do we place this inbetween Vigorous and The Middleline? Well, no. This is harder than both, but easier than the Aleph Sequence. \nOverall: This cant be determined. Its not the end. Not the beginning. Not anything. This cant be unclassified, too. "
    }
}